
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>随机存取存储器 · 制作一台计算机</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Bite01">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4-4.html" />
    
    
    <link rel="prev" href="4-2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-0.html">
            
                <a href="1-0.html">
            
                    
                    Logisim软件和二进制数字
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1-1.html">
            
                <a href="1-1.html">
            
                    
                    Logisim简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1-2.html">
            
                <a href="1-2.html">
            
                    
                    初探Logisim
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-0.html">
            
                <a href="2-0.html">
            
                    
                    逻辑门
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="2-1.html">
            
                <a href="2-1.html">
            
                    
                    非门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="2-2.html">
            
                <a href="2-2.html">
            
                    
                    或门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="2-3.html">
            
                <a href="2-3.html">
            
                    
                    与门
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-0.html">
            
                <a href="3-0.html">
            
                    
                    锁存器和触发器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="3-1.html">
            
                <a href="3-1.html">
            
                    
                    锁存器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="3-2.html">
            
                <a href="3-2.html">
            
                    
                    触发器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-0.html">
            
                <a href="4-0.html">
            
                    
                    集成电路
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="4-1.html">
            
                <a href="4-1.html">
            
                    
                    数字译码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="4-2.html">
            
                <a href="4-2.html">
            
                    
                    只读存储器
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.3" data-path="4-3.html">
            
                <a href="4-3.html">
            
                    
                    随机存取存储器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="4-4.html">
            
                <a href="4-4.html">
            
                    
                    十六进制数码管
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="4-5.html">
            
                <a href="4-5.html">
            
                    
                    加法器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="4-6.html">
            
                <a href="4-6.html">
            
                    
                    比较器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-0.html">
            
                <a href="5-0.html">
            
                    
                    开始制作计算机
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="5-1.html">
            
                <a href="5-1.html">
            
                    
                    制作一个能够执行指令的计算机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="5-2.html">
            
                <a href="5-2.html">
            
                    
                    制作一个能做加法运算的计算机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="5-3.html">
            
                <a href="5-3.html">
            
                    
                    制作一个带有内存的计算机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="5-4.html">
            
                <a href="5-4.html">
            
                    
                    制作一个支持条件跳转的计算机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.5" data-path="5-5.html">
            
                <a href="5-5.html">
            
                    
                    制作一个带按键输入的计算机
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-0.html">
            
                <a href="6-0.html">
            
                    
                    汇编语言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="6-1.html">
            
                <a href="6-1.html">
            
                    
                    MOV指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="6-2.html">
            
                <a href="6-2.html">
            
                    
                    ADD指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="6-3.html">
            
                <a href="6-3.html">
            
                    
                    JUMP指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="6-4.html">
            
                <a href="6-4.html">
            
                    
                    JUMPIF指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.5" data-path="6-5.html">
            
                <a href="6-5.html">
            
                    
                    OUT指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.6" data-path="6-6.html">
            
                <a href="6-6.html">
            
                    
                    IN指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.7" data-path="6-7.html">
            
                <a href="6-7.html">
            
                    
                    汇编器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-0.html">
            
                <a href="7-0.html">
            
                    
                    汇编实战
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="7-1.html">
            
                <a href="7-1.html">
            
                    
                    一段计算机的故事
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" data-path="7-2.html">
            
                <a href="7-2.html">
            
                    
                    fabonacci数列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.3" data-path="7-3.html">
            
                <a href="7-3.html">
            
                    
                    按键计数功能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.4" data-path="7-4.html">
            
                <a href="7-4.html">
            
                    
                    一个躲车小游戏
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-0.html">
            
                <a href="8-0.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >随机存取存储器</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;">&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;</h1>
<p>&#x4E0A;&#x4E00;&#x8282;&#x7684;&#x201C;&#x53EA;&#x8BFB;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x6709;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x7535;&#x8DEF;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x540E;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x9002;&#x5408;&#x518D;&#x88AB;&#x9891;&#x7E41;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x672C;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5728;&#x7535;&#x8DEF;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x9891;&#x7E41;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7684;&#x5143;&#x4EF6;&#xFF0C;&#x5B83;&#x53EB;&#x505A;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#xFF0C;&#x82F1;&#x6587;&#x540D;&#x79F0;&#x53EB;&#x201C;Random Access Memory&#x201D;&#xFF0C;&#x7B80;&#x79F0;RAM&#x3002;&#x5B83;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x4FD7;&#x7684;&#x53EB;&#x6CD5;&#x201C;&#x5185;&#x5B58;&#x201D;&#x3002;&#x56E0;&#x4E3A;&#x8981;&#x5728;&#x7535;&#x8DEF;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x6765;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7AEF;&#x4F1A;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x8BBE;&#x8BA1;&#x8D77;&#x6765;&#x4E5F;&#x4F1A;&#x590D;&#x6742;&#x4E9B;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x672C;&#x7AE0;&#x4E2D;&#x6700;&#x590D;&#x6742;&#x7684;&#x7535;&#x8DEF;&#x7ED3;&#x6784;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x7684;&#x7535;&#x8DEF;&#x7ED3;&#x6784;&#x91CC;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x7535;&#x5B50;&#x5143;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8BB2;&#x89E3;&#x5B83;&#x7684;&#x7535;&#x8DEF;&#x7ED3;&#x6784;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x8BA4;&#x8BC6;&#x4E0B;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x7535;&#x5B50;&#x5143;&#x4EF6;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E0B;&#x5B83;&#x5177;&#x6709;&#x4EC0;&#x4E48;&#x529F;&#x80FD;&#xFF1F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#xFF0C;&#x5F53;&#x63A7;&#x5236;&#x7AEF;&#x8F93;&#x5165;0&#x65F6;&#xFF0C;&#x4ED6;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x65AD;&#x5F00;&#x7684;&#x5BFC;&#x7EBF;&#xFF0C;&#x5F53;&#x63A7;&#x5236;&#x7AEF;&#x8F93;&#x5165;1&#x65F6;&#xFF0C;&#x4ED6;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8FDE;&#x901A;&#x7684;&#x5BFC;&#x7EBF;&#x3002;&#x542C;&#x4E0A;&#x53BB;&#x5F88;&#x50CF;&#x4E2A;&#x4F7F;&#x7528;&#x9AD8;&#x4F4E;&#x7535;&#x5E73;&#x6765;&#x63A7;&#x5236;&#x7684;&#x5F00;&#x5173;&#x662F;&#x5427;&#xFF1F;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p><img src="pic/4-6.gif" alt=""></p>
<p>&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x5462;&#xFF1F;&#x770B;&#x4E0A;&#x9762;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x4F3C;&#x4E4E;&#x7528;&#x4E00;&#x4E2A;&#x201C;&#x4E0E;&#x95E8;&#x201D;&#x4E5F;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x554A;&#xFF1F;&#x56E0;&#x4E3A;&#x201C;&#x4E0E;&#x95E8;&#x201D;&#x4E5F;&#x6709;&#x4FE1;&#x53F7;&#x653E;&#x884C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x5176;&#x4E2D;&#x533A;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x5982;&#x4E0B;&#x56FE;&#x5DE6;&#x4FA7;&#x7535;&#x8DEF;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x4E00;&#x6839;&#x5BFC;&#x7EBF;&#x4E0A;&#x88AB;&#x540C;&#x65F6;&#x8F93;&#x51FA;0&#x548C;1&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BFC;&#x7EBF;&#x5C31;&#x53D8;&#x6210;&#x7EA2;&#x8272;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x7535;&#x8DEF;&#x62A5;&#x9519;&#x4E86;&#xFF0C;&#x5728;&#x7535;&#x8DEF;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0D;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x77ED;&#x8DEF;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x4E0B;&#x56FE;&#x53F3;&#x4FA7;&#x7535;&#x8DEF;&#x90A3;&#x6837;&#xFF0C;&#x4E2D;&#x95F4;&#x52A0;&#x4E0A;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x63A7;&#x5236;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x7684;&#x5F00;&#x5173;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x540C;&#x65F6;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x8FDE;&#x63A5;&#x5230;&#x90A3;&#x6839;&#x7AD6;&#x76F4;&#x7684;&#x5BFC;&#x7EBF;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x628A;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x6362;&#x6210;&#x201C;&#x4E0E;&#x95E8;&#x201D;&#x7684;&#x8BDD;&#xFF0C;&#x662F;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5BFC;&#x7EBF;&#x4E0A;&#x9020;&#x6210;&#x51B2;&#x7A81;&#x77ED;&#x8DEF;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="pic/4-7.gif" alt=""></p>
<p>&#x6709;&#x4E86;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5236;&#x4F5C;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x7684;&#x903B;&#x8F91;&#x7535;&#x8DEF;&#x56FE;&#x3002;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x4E00;&#x7C7B;&#x662F;&#x591A;&#x4F4D;&#x6570;&#x636E;&#x4FE1;&#x53F7;&#x7C7B;&#xFF0C;&#x7531;&#x201C;&#x6570;&#x636E;&#x8F93;&#x5165;&#x201D;&#x548C;&#x201C;&#x5730;&#x5740;&#x8F93;&#x5165;&#x201D;&#x7EC4;&#x6210;&#xFF1B;&#x53E6;&#x4E00;&#x7C7B;&#x662F;&#x63A7;&#x5236;&#x4FE1;&#x53F7;&#x7C7B;&#xFF0C;&#x7531;&#x201C;&#x6570;&#x636E;&#x63A7;&#x5236;&#x201D;&#x3001;&#x201C;&#x5730;&#x5740;&#x63A7;&#x5236;&#x201D;&#x548C;&#x201C;&#x8F93;&#x51FA;&#x63A7;&#x5236;&#x201D;&#x7EC4;&#x6210;&#x3002;&#x6700;&#x53F3;&#x4FA7;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x7AEF;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x4E86;&#x201C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x7801;&#x7BA1;&#x201D;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5DE6;&#x4E0B;&#x65B9;&#x68AF;&#x5F62;&#x7684;&#x90A3;&#x4E2A;&#x7535;&#x5B50;&#x5143;&#x4EF6;&#x4F60;&#x8FD8;&#x8BB0;&#x5F97;&#x5417;&#xFF1F;&#x5B83;&#x5C31;&#x662F;&#x672C;&#x7AE0;&#x7B2C;&#x4E00;&#x8282;&#x8BB2;&#x8FC7;&#x7684;&#x201C;&#x6570;&#x5B57;&#x8BD1;&#x7801;&#x5668;&#x201D;&#x3002;</p>
<p><img src="pic/4-8.gif" alt=""></p>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x628A;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8BBE;&#x8BA1;&#x7684;&#x8FD9;&#x4E48;&#x590D;&#x6742;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x7535;&#x8DEF;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x52A8;&#x6001;&#x4FEE;&#x6539;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x6765;&#x6309;&#x6B65;&#x9AA4;&#x6F14;&#x793A;&#x4E0B;&#x5982;&#x4F55;&#x5728;&#x7535;&#x8DEF;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x628A;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x5730;&#x5740;&#x4E3A;1&#x7684;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x6210;2&#x3002;</p>
<ol>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x5730;&#x5740;&#x8F93;&#x5165;&#x201D;&#x7684;&#x503C;&#x4E3A;1</li>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x5730;&#x5740;&#x63A7;&#x5236;&#x201D;&#x7684;&#x503C;&#x7531;0&#x53D8;1&#xFF0C;&#x5730;&#x5740;&#x4FDD;&#x5B58;&#x5728;&#x8BD1;&#x7801;&#x5668;&#x524D;&#x7684;&#x89E6;&#x53D1;&#x5668;&#x91CC;&#x3002;</li>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x6570;&#x636E;&#x8F93;&#x5165;&#x201D;&#x7684;&#x503C;&#x4E3A;2</li>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x6570;&#x636E;&#x63A7;&#x5236;&#x201D;&#x7684;&#x503C;&#x7531;0&#x53D8;1&#x3002;&#x5230;&#x6B64;&#xFF0C;2&#x5C31;&#x88AB;&#x4FDD;&#x5B58;&#x5728;RAM&#x7684;&#x5730;&#x5740;1&#x5904;&#x4E86;&#x3002;</li>
</ol>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x518D;&#x6309;&#x6B65;&#x9AA4;&#x6F14;&#x793A;&#x4E0B;&#x5982;&#x4F55;&#x5728;&#x521A;&#x624D;&#x7535;&#x8DEF;&#x4E0A;&#xFF0C;&#x628A;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x5730;&#x5740;&#x4E3A;1&#x7684;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x7ED9;&#x201C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x7801;&#x7BA1;&#x201D;&#x3002;</p>
<ol>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x5730;&#x5740;&#x8F93;&#x5165;&#x201D;&#x7684;&#x503C;&#x4E3A;1</li>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x5730;&#x5740;&#x63A7;&#x5236;&#x201D;&#x7684;&#x503C;&#x7531;0&#x53D8;1&#xFF0C;&#x5730;&#x5740;&#x4FDD;&#x5B58;&#x5728;&#x8BD1;&#x7801;&#x5668;&#x524D;&#x7684;&#x89E6;&#x53D1;&#x5668;&#x91CC;&#x3002;</li>
<li>&#x8BBE;&#x7F6E;&#x201C;&#x8F93;&#x51FA;&#x63A7;&#x5236;&#x201D;&#x7684;&#x503C;&#x4E3A;1&#x3002;&#x5230;&#x6B64;&#xFF0C;&#x5730;&#x5740;1&#x7684;&#x6570;&#x636E;&#x5C31;&#x88AB;&#x8F93;&#x51FA;&#x5230;&#x201C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x7801;&#x7BA1;&#x201D;&#x4E86;&#x3002;</li>
</ol>
<p>&#x6F14;&#x793A;&#x52A8;&#x753B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="pic/4-9.gif" alt=""></p>
<p>&#x770B;&#x5B8C;&#x6F14;&#x793A;&#x52A8;&#x753B;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5206;&#x4E0B;RAM&#x662F;&#x5982;&#x4F55;&#x5B58;&#x53D6;&#x6570;&#x636E;&#x7684;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x201C;&#x6570;&#x5B57;&#x8BD1;&#x7801;&#x5668;&#x201D;&#x548C;&#x5DE6;&#x4FA7;&#x7684;&#x201C;&#x4E0E;&#x95E8;&#x5217;&#x201D;&#x662F;&#x7528;&#x6765;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x6216;&#x5B58;&#x50A8;&#x54EA;&#x4E2A;&#x89E6;&#x53D1;&#x5668;&#xFF0C;&#x53F3;&#x4FA7;&#x7684;&#x201C;&#x4E0E;&#x95E8;&#x5217;&#x201D;&#x548C;&#x201C;&#x65AD;&#x8DEF;&#x63A7;&#x5236;&#x5668;&#x201D;&#x5171;&#x540C;&#x63A7;&#x5236;&#x54EA;&#x4E2A;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x3002;&#x5177;&#x4F53;&#x7EC6;&#x8282;&#x5C31;&#x4E0D;&#x8D58;&#x8FF0;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4ECD;&#x7136;&#x5BF9;&#x6B64;&#x56F0;&#x60D1;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x628A;&#x672C;&#x4E66;&#x7684;&#x6F14;&#x793A;&#x4F8B;&#x5B50;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x673A;&#x7535;&#x8111;&#xFF0C;&#x4F7F;&#x7528;Logisim&#x8F6F;&#x4EF6;&#x5C1D;&#x8BD5;&#x653E;&#x6162;&#x901F;&#x5EA6;&#x6A21;&#x62DF;&#x5E76;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x6709;&#x52A9;&#x4E8E;&#x4F60;&#x66F4;&#x66F4;&#x5FEB;&#x7684;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#x5982;&#x4F55;&#x7528;Logisim&#x5185;&#x7F6E;&#x7684;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x6765;&#x5B8C;&#x6210;&#x540C;&#x6837;&#x7684;&#x7535;&#x8DEF;&#x529F;&#x80FD;&#x3002;&#x7531;&#x4E8E;&#x5185;&#x7F6E;&#x7684;&#x201C;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#x201D;&#x548C;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x7684;&#x4E0D;&#x592A;&#x76F8;&#x540C;&#xFF0C;&#x5B83;&#x628A;&#x201C;&#x6570;&#x636E;&#x8F93;&#x5165;&#x201D;&#x548C;&#x201C;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x201D;&#x90FD;&#x5408;&#x5E76;&#x5230;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x7AEF;&#x4E86;&#x3002;&#x53E6;&#x5916;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x5728;&#x5730;&#x5740;&#x8F93;&#x5165;&#x7AEF;&#x4E32;&#x8054;&#x4E2A;&#x89E6;&#x53D1;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x529F;&#x80FD;&#x4E86;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x6700;&#x540E;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x7684;&#x6548;&#x679C;&#x4E0A;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;&#x5176;&#x5B83;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x540E;&#x9762;&#x5F53;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x70B9;&#x533A;&#x522B;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x5F71;&#x54CD;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x5FFD;&#x7565;&#x8FD9;&#x70B9;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="pic/4-10.gif" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4-2.html" class="navigation navigation-prev " aria-label="Previous page: 只读存储器">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4-4.html" class="navigation navigation-next " aria-label="Next page: 十六进制数码管">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"随机存取存储器","level":"1.5.3","depth":2,"next":{"title":"十六进制数码管","level":"1.5.4","depth":2,"path":"doc/4-4.md","ref":"doc/4-4.md","articles":[]},"previous":{"title":"只读存储器","level":"1.5.2","depth":2,"path":"doc/4-2.md","ref":"doc/4-2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"sharing":{"qq":false,"all":["google","facebook","weibo","twitter","qq","qzone","linkedin","pocket"],"douban":false,"facebook":false,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Bite01","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"制作一台计算机","language":"zh-hans","gitbook":"3.2.3"},"file":{"path":"doc/4-3.md","mtime":"2023-09-20T04:38:39.049Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-09-20T06:43:18.612Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

